
//	Задача 1: Да се изведат на екрана числата от 1 до 100.

public class ex01 {

	public static void main(String[] args) {
		
		for (int i = 1; i < 101; i++) {
			System.out.print(i + " ");
		}

	}

}
