
//	Задача 2: Да се изведат на екрана числат от -20 до 50.

public class ex02 {

	public static void main(String[] args) {

		for (int i = -20; i < 51; i++) {
			System.out.print(i + " ");
		}

	}

}
